# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P5 outputs (Top-down only, no bottom-up)
# Ablasi 18: Baseline (Ablasi 13) + Increased area untuk high-res layers (area=16 untuk P2/P3) + Increased repeats di head (n=3)

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 465 layers, 9,285,632 parameters, 9,285,616 gradients, 21.7 GFLOPs

# YOLO12n backbone (SAMA DENGAN ABLASI 13)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 8, True]] # 6: A2C2f dengan area=8 dan residual=True
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 8, True]] # 8: A2C2f dengan area=8 dan residual=True

# YOLO12n head (ABLASI 18: TOP-DOWN dengan increased repeats n=3 dan adaptive area untuk high-res)
head:
  # ---------- TOP-DOWN (P5 -> P4 -> P3 -> P2) ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4 (6)
  - [-1, 3, A2C2f, [512, False, 8, True]] # 11: P4_n dengan n=3 (increased from 2), area=8 dan residual=True

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4_n -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3 (4)
  - [-1, 3, A2C2f, [256, False, 16, True]] # 14: P3_n dengan n=3 (increased from 2), area=16 (lebih besar untuk high-res) dan residual=True

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3_n -> P2 scale
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2 (2)
  - [-1, 3, A2C2f, [256, False, 16, True]] # 17: P2_n dengan n=3 (increased from 2), area=16 (lebih besar untuk high-res) dan residual=True

  # ---------- Detect di 4 scale: P2, P3, P4, P5 (dari top-down pathway) ----------
  # Note: P5 langsung dari backbone layer 8, P4-P2 dari top-down pathway
  - [[17, 14, 11, 8], 1, Detect, [nc]] # Detect(P2, P3, P4, P5) - top-down dengan increased repeats dan adaptive area untuk high-res

# Validating tb_detections_project/YOLOv12s_vanilla_run1_stage1/weights/best.pt...
# Ultralytics 8.3.63 🚀 Python-3.12.12 torch-2.9.0+cu126 CUDA:0 (Tesla T4, 15095MiB)
# YOLO12s-ablasi18 summary (fused): 406 layers, 7,305,268 parameters, 0 gradients, 35.2 GFLOPs
#                  Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 5/5 [00:04<00:00,  1.23it/s]
#                    all        140       1127      0.751      0.733      0.815      0.403
# Speed: 0.3ms preprocess, 10.6ms inference, 0.0ms loss, 3.6ms postprocess per image
# Results saved to tb_detections_project/YOLOv12s_vanilla_run1_stage1
