# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with Deformable Convolution (DCN) in Neck
# Ablation study: Deformable Convolution for adaptive feature extraction

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 465 layers, 2,603,056 parameters, 2,603,040 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 465 layers, 9,285,632 parameters, 9,285,616 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 501 layers, 20,201,216 parameters, 20,201,200 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 831 layers, 26,454,880 parameters, 26,454,864 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 831 layers, 59,216,928 parameters, 59,216,912 gradients, 200.3 GFLOPs

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head with Deformable Convolution in Neck
head:
  # ---------- TOP-DOWN (P5 -> P4 -> P3 -> P2) ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4 (6) -> output: 1024+512=1536 channels
  - [-1, 1, DeformConv, [1536, 512, 3, 1]] # 11: DeformConv for P4 (input: 1536, output: 512)
  - [-1, 2, A2C2f, [512, False, -1]] # 12: P4_n (refined P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13: upsample P4_n -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 14: cat backbone P3 (4) -> output: 512+512=1024 channels
  - [-1, 1, DeformConv, [1024, 256, 3, 1]] # 15: DeformConv for P3 (input: 1024, output: 256)
  - [-1, 2, A2C2f, [256, False, -1]] # 16: P3_n (refined P3)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17: upsample P3_n -> P2 scale
  - [[-1, 2], 1, Concat, [1]] # 18: cat backbone P2 (2) -> output: 256+256=512 channels
  - [-1, 1, DeformConv, [512, 256, 3, 1]] # 19: DeformConv for P2 (input: 512, output: 256)
  - [-1, 2, A2C2f, [256, False, -1]] # 20: P2_n (refined P2, STRIDE 4)

  # ---------- BOTTOM-UP (P2 -> P3 -> P4 -> P5) ----------
  - [-1, 1, Conv, [256, 3, 2]] # 21: downsample P2_n -> P3 scale
  - [[-1, 16], 1, Concat, [1]] # 22: cat P3_n -> output: 256+256=512 channels
  - [-1, 1, DeformConv, [512, 256, 3, 1]] # 23: DeformConv for P3 bottom-up (input: 512, output: 256)
  - [-1, 2, A2C2f, [256, False, -1]] # 24: P3_out

  - [-1, 1, Conv, [512, 3, 2]] # 25: downsample P3_out -> P4 scale
  - [[-1, 12], 1, Concat, [1]] # 26: cat P4_n -> output: 512+512=1024 channels
  - [-1, 1, DeformConv, [1024, 512, 3, 1]] # 27: DeformConv for P4 bottom-up (input: 1024, output: 512)
  - [-1, 2, A2C2f, [512, False, -1]] # 28: P4_out

  - [-1, 1, Conv, [1024, 3, 2]] # 29: downsample P4_out -> P5 scale
  - [[-1, 8], 1, Concat, [1]] # 30: cat backbone P5 (8) -> output: 1024+1024=2048 channels
  - [-1, 1, DeformConv, [2048, 1024, 3, 1]] # 31: DeformConv for P5 (input: 2048, output: 1024)
  - [-1, 2, C3k2, [1024, True]] # 32: P5_out

  # ---------- Detect di 4 scale: P2, P3, P4, P5 ----------
  - [[20, 24, 28, 32], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)

