# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P3 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-p2.yaml' will call yolov12-p2.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 465 layers, 9,285,632 parameters, 9,285,616 gradients, 21.7 GFLOPs

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3f, [256, True, 0.25]] # P2: c3k=True untuk small objects (BTA TBC/AFB)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3f, [512, True, 0.25]] # P3: c3k=True untuk small objects (BTA TBC/AFB)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head
# YOLO12-turbo head dengan P2

head:
  # ---------- P4 -> P3 ----------
  - [6, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P4 -> P3 size
  - [[-1, 4], 1, Concat, [1]] # 10: cat backbone P3 (layer 4)
  - [-1, 2, A2C2f, [256, False, -1]] # 11: head P3

  # ---------- P3 -> P2 ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P3 -> P2 size
  - [[-1, 1], 1, Concat, [1]] # 13: cat backbone P2 (layer 1)
  - [-1, 2, A2C2f, [256, False, -1]] # 14: head P2 (smallest objects)

  # ---------- P2 -> P3 (bottom-up) ----------
  - [-1, 1, Conv, [256, 3, 2]] # 15: downsample P2 -> P3 size
  - [[-1, 11], 1, Concat, [1]] # 16: cat dengan head P3
  - [-1, 2, A2C2f, [256, False, -1]] # 17: refined P3

  # ---------- Detect dengan P2–P3 ----------
  - [[14, 17], 1, Detect, [nc]] # 18: Detect(P2, P3)

