# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with ASFF (Adaptively Spatial Feature Fusion) in Neck
# Ablation study: ASFF module for multi-scale feature fusion

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 465 layers, 2,603,056 parameters, 2,603,040 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 465 layers, 9,285,632 parameters, 9,285,616 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 501 layers, 20,201,216 parameters, 20,201,200 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 831 layers, 26,454,880 parameters, 26,454,864 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 831 layers, 59,216,928 parameters, 59,216,912 gradients, 200.3 GFLOPs

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head with ASFF
head:
  # ---------- TOP-DOWN (P5 -> P4 -> P3 -> P2) ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4 (6)
  - [-1, 2, A2C2f, [512, False, -1]] # 11: P4_n (refined P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4_n -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3 (4)
  - [-1, 2, A2C2f, [256, False, -1]] # 14: P3_n (refined P3)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3_n -> P2 scale
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2 (2)
  - [-1, 2, A2C2f, [256, False, -1]] # 17: P2_n (refined P2, STRIDE 4)

  # ---------- BOTTOM-UP (P2 -> P3 -> P4 -> P5) ----------
  - [-1, 1, Conv, [256, 3, 2]] # 18: downsample P2_n -> P3 scale
  - [[-1, 14], 1, Concat, [1]] # 19: cat P3_n
  - [-1, 2, A2C2f, [256, False, -1]] # 20: P3_out

  - [-1, 1, Conv, [512, 3, 2]] # 21: downsample P3_out -> P4 scale
  - [[-1, 11], 1, Concat, [1]] # 22: cat P4_n
  - [-1, 2, A2C2f, [512, False, -1]] # 23: P4_out

  - [-1, 1, Conv, [1024, 3, 2]] # 24: downsample P4_out -> P5 scale
  - [[-1, 8], 1, Concat, [1]] # 25: cat backbone P5 (8)
  - [-1, 2, C3k2, [1024, True]] # 26: P5_out

  # ---------- ASFF Fusion Layers ----------
  # ASFF at P3 level (level=0): fuses P2(17, 256ch), P3(20, 256ch), P4(23, 512ch)
  # Output: 256 channels (matches P3)
  - [[17, 20, 23], 1, ASFF, [0, 256, 256, [256, 256, 512]]] # 27: ASFF_P3

  # ASFF at P4 level (level=1): fuses P3(20, 256ch), P4(23, 512ch), P5(26, 1024ch)
  # Output: 512 channels (matches P4)
  - [[20, 23, 26], 1, ASFF, [1, 512, 512, [256, 512, 1024]]] # 28: ASFF_P4

  # ASFF at P5 level (level=2): fuses P4(23, 512ch), P5(26, 1024ch), P5(26, 1024ch)
  # Output: 1024 channels (matches P5)
  - [[23, 26, 26], 1, ASFF, [2, 1024, 1024, [512, 1024, 1024]]] # 29: ASFF_P5

  # ---------- Detect di 4 scale: P2, ASFF_P3, ASFF_P4, ASFF_P5 ----------
  - [[17, 27, 28, 29], 1, Detect, [nc]] # Detect(P2, ASFF_P3, ASFF_P4, ASFF_P5)

