# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P5 outputs (Top-down only, no bottom-up)
# Ablasi 19: Best of Ablasi 13/15/16 - MLP ratio optimization (1.5 backbone, 2.5 head) + Increased repeats (n=5 backbone, n=3 head) + Adaptive area

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 465 layers, 9,285,632 parameters, 9,285,616 gradients, 21.7 GFLOPs

# YOLO12n backbone (ABLASI 19: MLP ratio 1.5 + Increased repeats n=5 untuk stronger features)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 5, A2C2f, [512, True, 8, True, 1.5]] # 6: A2C2f dengan n=5 (from 15), area=8, residual=True, mlp_ratio=1.5 (from 16)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 5, A2C2f, [1024, True, 8, True, 1.5]] # 8: A2C2f dengan n=5 (from 15), area=8, residual=True, mlp_ratio=1.5 (from 16)

# YOLO12n head (ABLASI 19: TOP-DOWN dengan MLP ratio 2.5, increased repeats n=3, dan adaptive area)
head:
  # ---------- TOP-DOWN (P5 -> P4 -> P3 -> P2) ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4 (6)
  - [-1, 3, A2C2f, [512, False, 8, True, 2.5]] # 11: P4_n dengan n=3 (from 16), area=8, residual=True, mlp_ratio=2.5 (from 16)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4_n -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3 (4)
  - [-1, 3, A2C2f, [256, False, 16, True, 2.5]] # 14: P3_n dengan n=3 (from 16), area=16 (adaptive from 15/16), residual=True, mlp_ratio=2.5 (from 16)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3_n -> P2 scale
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2 (2)
  - [-1, 3, A2C2f, [256, False, 16, True, 2.5]] # 17: P2_n dengan n=3 (from 16), area=16 (adaptive from 15/16), residual=True, mlp_ratio=2.5 (from 16)

  # ---------- Detect di 4 scale: P2, P3, P4, P5 (dari top-down pathway) ----------
  # Note: P5 langsung dari backbone layer 8, P4-P2 dari top-down pathway
  - [[17, 14, 11, 8], 1, Detect, [nc]] # Detect(P2, P3, P4, P5) - kombinasi best practices dari ablasi 13/15/16

# Validating tb_detections/YOLOv12s_vanilla_run1_stage1/weights/best.pt...
# Ultralytics 8.3.63 🚀 Python-3.12.12 torch-2.9.0+cu126 CUDA:0 (Tesla T4, 15095MiB)
# YOLO12s-ablasi19 summary (fused): 406 layers, 6,976,820 parameters, 0 gradients, 34.8 GFLOPs
#                  Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 5/5 [00:03<00:00,  1.32it/s]
#                    all        140       1127      0.743      0.778      0.823      0.411
# Speed: 0.3ms preprocess, 10.4ms inference, 0.0ms loss, 2.3ms postprocess per image
# Results saved to tb_detections/YOLOv12s_vanilla_run1_stage1
