# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P4 outputs - IMPROVED VERSION 2
# Improvements:
# 1. Fixed backbone channel (256 instead of 128)
# 2. Uses C3k2ECA for enhanced feature extraction with ECA attention
# 3. Reduced to P2-P4 detection (more focused on small-medium objects)
# 4. Better balance between performance and complexity

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024]

# YOLO12 backbone - FIXED CHANNELS
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]] # 2-P2/4 (FIXED: 256 instead of 128)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12 head with C3k2ECA for enhanced features (P2-P4 only)
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4
  - [-1, 2, C3k2ECA, [512, False, 0.25, 3]] # 11: P4 with ECA attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4 -> P3
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3
  - [-1, 2, C3k2ECA, [256, False, 0.25, 3]] # 14: P3 with ECA attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3 -> P2
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2
  - [-1, 2, C3k2ECA, [256, False, 0.25, 3]] # 17: P2 with ECA attention (enhanced for small objects)

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]] # 18: downsample P2 -> P3
  - [[-1, 14], 1, Concat, [1]] # 19: cat head P3
  - [-1, 2, C3k2ECA, [256, False, 0.25, 3]] # 20: P3 refined

  - [-1, 1, Conv, [512, 3, 2]] # 21: downsample P3 -> P4
  - [[-1, 11], 1, Concat, [1]] # 22: cat head P4
  - [-1, 2, C3k2ECA, [512, False, 0.25, 3]] # 23: P4 refined

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P2+ECA, P3+ECA, P4+ECA) - Focused on small-medium objects


