# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P5 outputs (Bottom-up only, no top-down)
# Ablasi 5: Simplified neck with only bottom-up pathway

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 465 layers, 2,603,056 parameters, 2,603,040 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 465 layers, 9,285,632 parameters, 9,285,616 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 501 layers, 20,201,216 parameters, 20,201,200 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 831 layers, 26,454,880 parameters, 26,454,864 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 831 layers, 59,216,928 parameters, 59,216,912 gradients, 200.3 GFLOPs

# YOLO12n backbone (SAMA DENGAN ABLASI 1)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head (ABLASI 5: BOTTOM-UP ONLY, NO TOP-DOWN)
head:
  # ---------- BOTTOM-UP (P2 -> P3 -> P4 -> P5) ----------
  # Start dari backbone P2 (layer 2)
  - [2, 2, A2C2f, [256, False, -1]] # 9: process P2 dari backbone

  - [-1, 1, Conv, [256, 3, 2]] # 10: downsample P2 -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 11: cat dengan backbone P3 (4)
  - [-1, 2, A2C2f, [256, False, -1]] # 12: P3_out

  - [-1, 1, Conv, [512, 3, 2]] # 13: downsample P3_out -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 14: cat dengan backbone P4 (6)
  - [-1, 2, A2C2f, [512, False, -1]] # 15: P4_out

  - [-1, 1, Conv, [1024, 3, 2]] # 16: downsample P4_out -> P5 scale
  - [[-1, 8], 1, Concat, [1]] # 17: cat dengan backbone P5 (8)
  - [-1, 2, C3k2, [1024, True]] # 18: P5_out

  # ---------- Detect di 4 scale: P2, P3, P4, P5 (dari bottom-up pathway) ----------
  # Note: P2 dari processed head (layer 9), P3-P5 dari bottom-up pathway
  - [[9, 12, 15, 18], 1, Detect, [nc]] # Detect(P2, P3, P4, P5) - bottom-up only

# Ultralytics 8.3.63 🚀 Python-3.12.12 torch-2.9.0+cu126 CUDA:0 (Tesla T4, 15095MiB)
# YOLO12s-ablasi5 summary (fused): 379 layers, 10,198,196 parameters, 0 gradients, 35.6 GFLOPs
#                  Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 5/5 [00:04<00:00,  1.19it/s]
#                    all        140       1127      0.733      0.732      0.795      0.385
# Speed: 0.5ms preprocess, 10.0ms inference, 0.1ms loss, 2.9ms postprocess per image
# Results saved to tb_detections_project/YOLOv12s_vanilla_run1_stage1
