# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with CBAM (Channel + Spatial Attention) in Neck
# Ablasi 8: Baseline (Ablasi 4) + CBAM untuk dual attention (channel + spatial)

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone (SAMA DENGAN ABLASI 4)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head (ABLASI 8: TOP-DOWN + CBAM ATTENTION)
head:
  # ---------- TOP-DOWN (P5 -> P4 -> P3 -> P2) ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4 (6)
  - [-1, 2, A2C2f, [512, False, -1]] # 11: P4_n (refined P4)
  - [-1, 1, CBAM, [512]] # 11a: CBAM attention untuk P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4_n -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3 (4)
  - [-1, 2, A2C2f, [256, False, -1]] # 14: P3_n (refined P3)
  - [-1, 1, CBAM, [256]] # 14a: CBAM attention untuk P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3_n -> P2 scale
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2 (2)
  - [-1, 2, A2C2f, [256, False, -1]] # 17: P2_n (refined P2, STRIDE 4)
  - [-1, 1, CBAM, [256]] # 17a: CBAM attention untuk P2

  # CBAM untuk P5 dari backbone
  - [8, 1, CBAM, [1024]] # 8a: CBAM attention untuk P5

  # ---------- Detect di 4 scale: P2, P3, P4, P5 (dengan CBAM) ----------
  - [[17, 14, 11, 8], 1, Detect, [nc]] # Detect(P2+CBAM, P3+CBAM, P4+CBAM, P5+CBAM)

