# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with Enhanced Neck (Multiple Improvements)
# Ablasi 11: Baseline (Ablasi 4) + Kombinasi ECA + Deformable Conv untuk best performance

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone (SAMA DENGAN ABLASI 4)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head (ABLASI 11: TOP-DOWN + ECA + DeformConv)
head:
  # ---------- TOP-DOWN (P5 -> P4 -> P3 -> P2) ----------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4 scale
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4 (6)
  - [-1, 1, DeformConv, [1536, 512, 3, 1]] # 11a: DeformConv untuk adaptive sampling
  - [-1, 2, A2C2f, [512, False, -1]] # 11: P4_n (refined P4)
  - [-1, 1, ECA, [512, 512]] # 11b: ECA attention untuk P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4_n -> P3 scale
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3 (4)
  - [-1, 1, DeformConv, [1024, 256, 3, 1]] # 14a: DeformConv untuk adaptive sampling
  - [-1, 2, A2C2f, [256, False, -1]] # 14: P3_n (refined P3)
  - [-1, 1, ECA, [256, 256]] # 14b: ECA attention untuk P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3_n -> P2 scale
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2 (2)
  - [-1, 1, DeformConv, [512, 256, 3, 1]] # 17a: DeformConv untuk adaptive sampling
  - [-1, 2, A2C2f, [256, False, -1]] # 17: P2_n (refined P2, STRIDE 4)
  - [-1, 1, ECA, [256, 256]] # 17b: ECA attention untuk P2

  # ECA untuk P5 dari backbone
  - [8, 1, ECA, [1024, 1024]] # 8a: ECA attention untuk P5

  # ---------- Detect di 4 scale: P2, P3, P4, P5 (dengan ECA + DeformConv) ----------
  - [[17, 14, 11, 8], 1, Detect, [nc]] # Detect(P2+ECA+DCN, P3+ECA+DCN, P4+ECA+DCN, P5+ECA)

