# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P4 outputs + SPPF
# Ablasi 4: Baseline (Ablasi 2) + SPPF untuk multi-scale spatial pooling
# SPPF ditambahkan sebelum A2C2f di backbone (mengikuti pattern YOLOv10/11)

# Parameters
nc: 1 # number of classes (BTA)
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024]

# YOLO12 backbone dengan SPPF
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 8: SPPF untuk multi-scale spatial pooling (mengikuti YOLOv10/11 pattern)
  - [-1, 4, A2C2f, [1024, True, 1]] # 9: A2C2f setelah SPPF

# YOLO12 head (P2-P4)
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10: upsample dari P5 (layer 9)
  - [[-1, 6], 1, Concat, [1]] # 11: cat dengan P4 (dari backbone layer 6)
  - [-1, 2, A2C2f, [512, False, -1]] # 12: process P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13: upsample dari P4
  - [[-1, 4], 1, Concat, [1]] # 14: cat dengan P3 (dari backbone layer 4)
  - [-1, 2, A2C2f, [256, False, -1]] # 15: process P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16: upsample dari P3
  - [[-1, 2], 1, Concat, [1]] # 17: cat dengan P2 (dari backbone layer 2)
  - [-1, 2, A2C2f, [128, False, -1]] # 18: process P2 (output channels 128)

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]] # 19: downsample P2 (128 -> 256 channels)
  - [[-1, 15], 1, Concat, [1]] # 20: cat dengan P3 head (layer 15)
  - [-1, 2, A2C2f, [256, False, -1]] # 21: process P3

  - [-1, 1, Conv, [512, 3, 2]] # 22: downsample P3 (256 -> 512 channels)
  - [[-1, 12], 1, Concat, [1]] # 23: cat dengan P4 head (layer 12)
  - [-1, 2, A2C2f, [512, False, -1]] # 24: process P4

  - [[18, 21, 24], 1, Detect, [nc]] # 25: Detect(P2, P3, P4)

# Ablasi 4: Baseline + SPPF
# Expected: Better multi-scale feature extraction dengan spatial pyramid pooling
# Pattern: SPPF sebelum A2C2f (mengikuti YOLOv10/11: SPPF → Attention)
