# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P4 outputs - OPTIMIZED FOR SMALL OBJECTS (microscope)
# Optimizations for better mAP on small objects:
# - Increased backbone depth (C3k2: 2→3, A2C2f: 4→6)
# - Enhanced attention (A2C2f with area=4 in all head layers)
# - More head layers (A2C2f: 2→3 repeats)
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-p2.yaml' will call yolov12-p2.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 465 layers, 2,603,056 parameters, 2,603,040 gradients, 6.7 GFLOPs
  s: [0.67, 0.50, 1024] # OPTIMIZED: Increased depth from 0.50 to 0.67 for better feature extraction
  m: [0.50, 1.00, 512] # summary: 501 layers, 20,201,216 parameters, 20,201,200 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 831 layers, 26,454,880 parameters, 26,454,864 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 831 layers, 59,216,928 parameters, 59,216,912 gradients, 200.3 GFLOPs

# YOLO12n backbone - ENHANCED for small objects
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]] # OPTIMIZED: Increased from 2 to 3 repeats
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, C3k2, [512, False, 0.25]] # OPTIMIZED: Increased from 2 to 3 repeats
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, A2C2f, [512, True, 4]] # OPTIMIZED: Increased from 4 to 6 repeats, area=4 for attention
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 6, A2C2f, [1024, True, 4]] # OPTIMIZED: Increased from 4 to 6 repeats, area=4 for attention

# YOLO12n head - ENHANCED for small object detection
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, A2C2f, [512, False, 4]] # OPTIMIZED: Increased from 2 to 3 repeats, area=4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, A2C2f, [256, False, 4]] # OPTIMIZED: Increased from 2 to 3 repeats, area=4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, A2C2f, [256, False, 4]] # OPTIMIZED: Increased from 2 to 3 repeats, area=4 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P3
  - [-1, 3, A2C2f, [256, False, 4]] # OPTIMIZED: Increased from 2 to 3 repeats, area=4 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 3, A2C2f, [512, False, 4]] # OPTIMIZED: Increased from 2 to 3 repeats, area=4 (P4/16-medium)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P2, P3, P4) - P2 for small objects!

