# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P4 outputs for small object detection

# Parameters
nc: 1 # number of classes (BTA)
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone (TIDAK DIUBAH)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head (MODIFIED for P2-P4)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, A2C2f, [128, False, -1]] # 17 (P2/4-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P3
  - [-1, 2, A2C2f, [256, False, -1]] # 20 (P3/8-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 23 (P4/16-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P2, P3, P4)

# P2-P4
# Validating tb_detections/YOLOv12s_vanilla_run1_stage1/weights/best.pt...
# Ultralytics 8.3.63 🚀 Python-3.12.12 torch-2.9.0+cu126 CUDA:0 (Tesla T4, 15095MiB)
# YOLO12s-k summary (fused): 388 layers, 7,150,483 parameters, 0 gradients, 28.3 GFLOPs
#                  Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 5/5 [00:02<00:00,  1.90it/s]
#                    all        140       1127      0.718      0.738      0.787      0.377
# Speed: 0.2ms preprocess, 8.4ms inference, 0.0ms loss, 2.4ms postprocess per image
# Results saved to tb_detections/YOLOv12s_vanilla_run1_stage1

