# YOLOv12s 🚀, AGPL-3.0 license
# YOLOv12s object detection model optimized for SMALL OBJECTS (microscope) with P2-P4 outputs
# Optimized for better mAP on small objects by:
# - Using P2 detection scale (4x resolution) for tiny objects
# - Increased backbone depth for better feature extraction
# - Enhanced attention mechanisms (A2C2f with area attention)
# - More layers in head for better feature fusion

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  s: [0.67, 0.50, 1024] # Increased depth from 0.50 to 0.67 for better feature extraction

# YOLO12s backbone - Enhanced for small objects
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]] # Increased from 2 to 3 repeats
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, C3k2, [512, False, 0.25]] # Increased from 2 to 3 repeats
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, A2C2f, [512, True, 4]] # Increased from 4 to 6 repeats, area=4 for attention
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 6, A2C2f, [1024, True, 4]] # Increased from 4 to 6 repeats, area=4 for attention

# YOLO12s head - P2-P4 for small object detection
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, A2C2f, [512, False, 4]] # Increased from 2 to 3 repeats, area=4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, A2C2f, [256, False, 4]] # Increased from 2 to 3 repeats, area=4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, A2C2f, [256, False, 4]] # P2/4-xsmall for tiny objects, area=4

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P3
  - [-1, 3, A2C2f, [256, False, 4]] # Increased from 2 to 3 repeats, area=4

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 3, A2C2f, [512, False, 4]] # Increased from 2 to 3 repeats, area=4

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P2, P3, P4) - P2 for small objects!

