# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P4 outputs + ASFF - IMPROVED VERSION 3
# Improvements:
# 1. Fixed backbone channel (256 instead of 128)
# 2. ASFF (Adaptively Spatial Feature Fusion) for better multi-scale fusion
# 3. Enhanced P2 with better feature extraction
# 4. More efficient architecture with ASFF

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  s: [0.50, 0.50, 1024]

# YOLO12 backbone - FIXED CHANNELS
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]] # 2-P2/4 (FIXED: 256 instead of 128)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12 head with ASFF for adaptive feature fusion
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: upsample P5 -> P4
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11: P4_n

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: upsample P4_n -> P3
  - [[-1, 4], 1, Concat, [1]] # 13: cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14: P3_n

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: upsample P3_n -> P2
  - [[-1, 2], 1, Concat, [1]] # 16: cat backbone P2
  - [-1, 2, A2C2f, [256, False, -1]] # 17: P2_n (256 channels for better small object detection)

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]] # 18: downsample P2_n -> P3
  - [[-1, 14], 1, Concat, [1]] # 19: cat P3_n
  - [-1, 2, A2C2f, [256, False, -1]] # 20: P3_out

  - [-1, 1, Conv, [512, 3, 2]] # 21: downsample P3_out -> P4
  - [[-1, 11], 1, Concat, [1]] # 22: cat P4_n
  - [-1, 2, A2C2f, [512, False, -1]] # 23: P4_out

  # ASFF Fusion Layers for adaptive multi-scale fusion
  # ASFF at P2 level: fuses P2 itself (single level, but can enhance)
  # ASFF at P3 level (level=0): fuses P2(17, 256ch), P3(20, 256ch), P4(23, 512ch)
  - [[17, 20, 23], 1, ASFF, [0, 256, 256, [256, 256, 512]]] # 24: ASFF_P3

  # ASFF at P4 level (level=1): fuses P2(17, 256ch), P3(20, 256ch), P4(23, 512ch)
  - [[17, 20, 23], 1, ASFF, [1, 512, 512, [256, 256, 512]]] # 25: ASFF_P4

  # Detect with ASFF-enhanced features
  - [[17, 24, 25], 1, Detect, [nc]] # Detect(P2, ASFF_P3, ASFF_P4)


